In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/LinkedInLearning/data_cleaning_python_2883183/main/Ch05/05_04/rides.csv')

In [3]:
df.head()

       name  plate  distance
0     Gomez   1XZ2       3.7
1  Morticia    NaN       2.1
2    Fester              3.4
3     Lurch  Q38X3      -3.2
4       NaN    03A      14.3

In [4]:
df.dtypes

name         object
plate        object
distance    float64
dtype: object

In [5]:
# use eval method to check if a name column has null or distance column has less than or equal to zero
# bad data
mask = df.eval('name.isnull() | distance <= 0')
mask

0    False
1    False
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [6]:
# extract only what is not mask
df = df[~mask]
df

        name  plate  distance
0      Gomez   1XZ2      3.70
1   Morticia    NaN      2.10
2     Fester             3.40
5  Wednesday      A      0.30
6    Pugsley  ZF003    153.14

In [7]:
# can reset the index above since there is missing/gap
df = df.reset_index()

In [8]:
df

   index       name  plate  distance
0      0      Gomez   1XZ2      3.70
1      1   Morticia    NaN      2.10
2      2     Fester             3.40
3      5  Wednesday      A      0.30
4      6    Pugsley  ZF003    153.14